
words = ['code', 'bit', 'list', 'soul', 'next', "little", "snake", "wellplayed"]  # слова для кодирования в азбуку морзе

morse_codes = {
    "0": "-----", "1": ".----", "2": "..---", "3": "...--", "4": "....-",
    "5": ".....", "6": "-....", "7": "--...", "8": "---..", "9": "----.",
    "a": ".-", "b": "-...", "c": "-.-.", "d": "-..", "e": ".", "f": "..-.",
    "g": "--.", "h": "....", "i": "..", "j": ".---", "k": "-.-", "l": ".-..",
    "m": "--", "n": "-.", "o": "---", "p": ".--.", "q": "--.-", "r": ".-.",
    "s": "...", "t": "-", "u": "..-", "v": "...-", "w": ".--", "x": "-..-",
    "y": "-.--", "z": "--..", ".": ".-.-.-", ",": "--..--", "?": "..--..",
    "!": "-.-.--", "-": "-....-", "/": "-..-.", "@": ".--.-.", "(": "-.--.",
    ")": "-.--.-"
}

answers = []  # инициализируем список куда будем складывать правильные-неправильные ответы


################################################################################# объявляем функции


def morse_encode(word):  # создаём функцию, кодирующую слово в морзянку, аргументом которой будет кодируемое слово
    word_morse = []  # инициализируем пустую строку, куда будем складывать коды морзе каждой буквы
    for i in word:  # перебираем каждый символ в слове, переданном в качестве аргумента
        word_morse.append(morse_codes[i])  # добавляем значение для нужной буквы в строку с кодами морзе и пробел в конце для разделения                                          # добавляем значение для нужной буквы в строку с кодами морзе и пробел в конце для разделения
    return word_morse  # возвращаем закодированную строку, но без последнего пробела


print(morse_encode(words[0]))